{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "Business & Finance",
    "1": "Computers & Internet",
    "2": "Education & Reference",
    "3": "Entertainment & Music",
    "4": "Family & Relationships",
    "5": "Health",
    "6": "Politics & Government",
    "7": "Science & Mathematics",
    "8": "Society & Culture",
    "9": "Sports"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Business & Finance": 0,
    "Computers & Internet": 1,
    "Education & Reference": 2,
    "Entertainment & Music": 3,
    "Family & Relationships": 4,
    "Health": 5,
    "Politics & Government": 6,
    "Science & Mathematics": 7,
    "Society & Culture": 8,
    "Sports": 9
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.51.3",
  "vocab_size": 30522
}
